slides/06-primeira-ferramenta.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>Primeira Ferramenta</title>
<meta name="author" content="Lucas S. Vieira"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/reveal.js@4/dist/reveal.css"/>

<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/reveal.js@4/dist/theme/night.css" id="theme"/>

<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/reveal.js@4/plugin/highlight/zenburn.css"/>
<!-- If the query includes 'print-pdf', include the PDF print sheet -->
</head>
<body>
<div class="reveal">
<div class="slides">
<section id="sec-title-slide" data-background="./slide_06.gif"><p style="font-size:0.7em;opacity:0.6;">Lucas S. Vieira</p><br/><h2>Primeira Ferramenta</h2><br/><p style="font-size:0.85em;opacity:0.8;">Dando poderes ao agente</p><br/><p style="font-size:0.9em;color:#FFB033;">Guilda de IA</p>
</section>
<section>
<section id="slide-org596eeb3">
<h2 id="org596eeb3">O problema do LLM puro</h2>
<p class="fragment (appear)">
LLMs são ruins em matemática.
</p>

<div class="org-src-container">

<pre   ><code class="text" >Pergunta: "Quanto é 234 × 987?"
</code></pre>
</div>

<p>
O modelo não calcula. Ele <b>prevê</b> a resposta baseado em padrões.
Pode acertar, pode errar.
</p>
</section>
</section>
<section>
<section id="slide-orgcc52fc0">
<h2 id="orgcc52fc0">A solução: ferramentas</h2>
<p class="fragment (appear)">
Ferramenta = função Python que o agente pode chamar.
</p>
</section>
<section id="slide-org4d6e5cf">
<h3 id="org4d6e5cf">Como funciona:</h3>
<ol>
<li class="fragment appear">Modelo recebe descrição da ferramenta</li>
<li class="fragment appear">Analisa a pergunta</li>
<li class="fragment appear">Decide: preciso dessa ferramenta?</li>
<li class="fragment appear">Se sim, gera chamada no formato correto</li>
<li class="fragment appear">Python executa e devolve resultado</li>
<li class="fragment appear">Modelo usa resultado na resposta</li>

</ol>
</section>
</section>
<section>
<section id="slide-orgfe11bda">
<h2 id="orgfe11bda">Exemplo: calculadora</h2>
<div class="org-src-container">

<pre   ><code class="python" >def calcular(expressao):
    """Resolve expressão matemática."""
    return str(eval(expressao))

# Exemplo:
calcular("234 * 987")  # "230958"
</code></pre>
</div>
</section>
</section>
<section>
<section id="slide-org4b2f32f">
<h2 id="org4b2f32f">O segredo: descrição clara</h2>
<p>
O modelo decide baseado na descrição.
</p>

<p>
<b>Descrição ruim:</b>
</p>
<blockquote  class="fragment (appear)">
<p>
"Calculadora."
</p>
</blockquote>

<p>
→ Modelo não sabe quando usar.
</p>

</section>
<section id="slide-org4b2f32f-split">
<p>
<b>Descrição boa:</b>
</p>
<blockquote  class="fragment (appear)">
<p>
"Resolve expressões matemáticas. Use quando precisar
fazer cálculos. Ex: '2 + 2', '10 * 5', '(5 + 3) / 2'."
</p>
</blockquote>

<p>
→ Modelo entende quando e como usar.
</p>
</section>
</section>
<section>
<section id="slide-org2d71280">
<h2 id="org2d71280">O formato de chamada</h2>
<p>
O modelo precisa gerar algo que Python entenda.
</p>

<div class="org-src-container">

<pre   ><code class="text" >USAR_FERRAMENTA: calculadora
ARGUMENTO: 234 * 987
</code></pre>
</div>

<p>
Seu código:
</p>
<ol>
<li>Detecta isso na resposta</li>
<li>Executa a função</li>
<li>Devolve o resultado para o modelo</li>

</ol>
</section>
</section>
<section>
<section id="slide-orgaf91a2b">
<h2 id="orgaf91a2b">Diagrama</h2>
<div class="org-src-container">

<pre   ><code class="text" >Usuário: "Quanto é 234 × 987?"
    ↓
Agente: "Preciso da calculadora"
    ↓
Ferramenta: calcular("234 * 987") = 230958
    ↓
Agente: "230.958"
</code></pre>
</div>
</section>
</section>
<section>
<section id="slide-org9523d84">
<h2 id="org9523d84">Para lembrar</h2>
<blockquote  class="fragment (appear)">
<p>
"Ferramenta transforma conversa em ação."
</p>
</blockquote>

<p class="fragment (appear)">
LLM puro: só fala
Agente com ferramenta: fala E faz
</p>
</section>
</section>
<section>
<section id="slide-org94511f2">
<h2 id="org94511f2">Próxima semana</h2>
<ul>
<li class="fragment appear">Múltiplas ferramentas</li>
<li class="fragment appear">Como o modelo escolhe qual usar</li>
<li class="fragment appear">Descrições mais específicas</li>

</ul>
</section>
</section>
<section>
<section id="slide-orgc2cc0bf">
<h2 id="orgc2cc0bf">Perguntas?</h2>
</section>
</section>
</div>
</div>
<script src="https://cdn.jsdelivr.net/npm/reveal.js@4/dist/reveal.js"></script>

<script>
// Full list of configuration options available here:
// https://github.com/hakimel/reveal.js#configuration
Reveal.initialize({

// Optional libraries used to extend on reveal.js
dependencies: [
 { src: 'https://cdn.jsdelivr.net/npm/reveal.js@4/plugin/highlight/highlight.js', async: true, callback: function() { hljs.initHighlightingOnLoad(); } }]

});

</script>
</body>
</html>
